### DATA FRAME LIST AND LIST OF DICTIONARIES

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
name=['arju','pooja','saleem','sneha']
age=[24,56,24,13,27]

In [3]:
df=pd.DataFrame(list(zip(name,age)))
df

        0   1
0    arju  24
1   pooja  56
2  saleem  24
3   sneha  13

### ADDING COLUMN NAME

In [4]:
df=pd.DataFrame(list(zip(name,age)),columns=['Name','Age'])

In [5]:
df

     Name  Age
0    arju   24
1   pooja   56
2  saleem   24
3   sneha   13

### LIST OF DICTIONARY METHOD

In [6]:
list_of_dict=[
    
        {'Name':'arju','Age':24},
       {'Name':'pooja','Age':27},
       {'Name':'saleem','Age':25},
       {'Name':'sneha','Age':25},
       {'Name':'rajeev','Age':23}
        
]

In [7]:
list_of_dict

[{'Name': 'arju', 'Age': 24},
 {'Name': 'pooja', 'Age': 27},
 {'Name': 'saleem', 'Age': 25},
 {'Name': 'sneha', 'Age': 25},
 {'Name': 'rajeev', 'Age': 23}]

In [8]:
dfdict=pd.DataFrame(list_of_dict)

In [9]:
dfdict.head()

     Name  Age
0    arju   24
1   pooja   27
2  saleem   25
3   sneha   25
4  rajeev   23

### TASK

In [10]:
Name=['RITA','ARUN','SITA','VARUN','RAM','RADHA','MOHAN','DEVI','NIDHI']
Age=[23,29,14,21,32,23,51,20,29]
Dob=['20/12/1997','13/08/1998','15/08/1999','19/08/1998','15/12/1996','14/10/1996','20/8/1992','15/06/1999','17/06/2000']
Gender=['f','m','f','m','m','f','m','f','f']

In [11]:
df1=pd.DataFrame(list(zip(Name,Age,Dob,Gender)),columns=['name','age','dob','gender'])

In [12]:
df1

    name  age         dob gender
0   RITA   23  20/12/1997      f
1   ARUN   29  13/08/1998      m
2   SITA   14  15/08/1999      f
3  VARUN   21  19/08/1998      m
4    RAM   32  15/12/1996      m
5  RADHA   23  14/10/1996      f
6  MOHAN   51   20/8/1992      m
7   DEVI   20  15/06/1999      f
8  NIDHI   29  17/06/2000      f

In [13]:
list_of_dict1=[
    
        {'Name':'RITA','Age':24,'dob':'20/12/1997','gender':'f'},
       {'Name':'ARUN','Age':27,'dob':"13/08/1998",'gender':'m'},
       {'Name':'SITA','Age':25,'dob':'15/08/1999','gender':'f'},
       {'Name':'VARUN','Age':25,'dob':'19/08/1998','gender':'m'},
       {'Name':'RAM','Age':23,'dob':'15/12/1996','gender':'m'},
       {'Name':'RADHA','Age':24,'dob':'14/10/1996','gender':'f'},
       {'Name':'MOHAN','Age':27,'dob':'20/8/1992','gender':'m'},
       {'Name':'DEVI','Age':25,'dob':'15/06/1999','gender':'f'},
       {'Name':'NIDHI','Age':25,'dob':'17/06/2000','gender':'f'}
       
        
]

In [15]:
df2=pd.DataFrame(list_of_dict1)

In [16]:
df2

    Name  Age         dob gender
0   RITA   24  20/12/1997      f
1   ARUN   27  13/08/1998      m
2   SITA   25  15/08/1999      f
3  VARUN   25  19/08/1998      m
4    RAM   23  15/12/1996      m
5  RADHA   24  14/10/1996      f
6  MOHAN   27   20/8/1992      m
7   DEVI   25  15/06/1999      f
8  NIDHI   25  17/06/2000      f